#쐊찦얡 Unit 1
stick
stimulate
stir
infer
inference
inferior
influence
influential
inform
information
approach
appropriate
approval
approve
apt
conform
confront
confuse
confusion
congress
connect
connection
conscious
dismiss
disorder
disperse
displace
display
distribute
distort
distract
evolution
evolve
exaggerate
examine
mock
mode
model
moderate
modern
modernization
modest
modify
predecessor
predict
preface
preferable
preference
prejudice
preliminary
premier
premise
premium
preparation
reflect
reflection
reform
reject
rejoice
relate
relation
relationship
relative
relativity
relevant
overlook
overseas

#쐊찦얡 Unit 2
holy
honor
honorable
horizon
horizontal
ingenious
ingredient
initial
initiate
initiative
local
locality
locate
location
neglect
negligible
prescribe
prescription
presence
present
presently
preserve
preside
press
pressure
prestige
presumably
presume
prevent
previous
prey
reliable
reliance
religion
religious
rely
straight
straightforward
strain
strategy
strength
strengthen
strenuous
transaction
transfer
transform
transient
translation
architect
architecture
area
argue
argument
arise
arouse
array
visible
vision
visual
vital
vivid
void
volume
consequence
consequently
conservation
conservative
consider
considerable
considerate
consume
consumption
dispute
dissolve
exchange
exclude
exclusive

#쐊찦얡 Unit 3
pose
position
positive
possess
possession
dilute
dim
diminish
amateur
amaze
ambiguous
ambition
ambitious
bubble
budget
build
business
compress
comprise
compromise
conceive
concentrate
concept
conception
concern
concise
concrete
conclude
conclusion
confer
conference
confess
epidemic
episode
epoch
indifferent
indignant
indignation
indispensable
individual
mess
message
messenger
method
militant
military
mind
redeem
reduce
reduction
refer
reference
spoil
sponsor
spread
spur
spy
stability
stable
staff
stage

#쐊찦얡 Unit 4
console
consist
consistent
constant
constituent
constitute
constitution
constrain
construct
distinct
distinction
distinguish
fruitful
frustrate
fulfil
function
fund
fundamental
anguish
annoy
annual
monopoly
monotonous
mood
transmission
transmit
transplant
transport
stock
store
storage
stride
strike
striking
string
structure
stun
primary
prime
primitive
principal
principle
psychiatry
psychology
liability
liable
liberal
liberate
licence
innocent
innovation
evidence
evident
evil
environment
enterprise
entertain
entertainment

#쐊찦얡 Unit 5
remote
remove
removal
remain
remainder
remains
remedy
remember
remind
render
contemporary
contempt
content
contend
contest
context
continual
continue
continuous
contract
contradict
contrary
contrast
diverse
diversion
divert
divide
dividend
division
document
documentary
execute
executive
exemplify
exert
exhaust
exist
existence
exotic
moral
morality
moreover
mostly
prior
priority
privacy
private
privilege
prove
provide
provided
prudent
subject
subjective
submit
subordinate
subscribe
subsequent
substance
substantial
substitute
subtle
treat
treaty
trend
associate
association
amend
among
amount
ample
amuse
anchor

#쐊찦얡 Unit 6
stand
standard
standpoint
start
startle
starve
state
statement
statesman
statistics
statue
status
statute
stay
steady
steer
stem
step
stern
anonymous
answer
anticipate
anxiety
anxious
apart
assassinate
assault
assemble
assembly
assert
component
compose
composition
comprehend
comprehension
comprehensive
condemn
condense
condition
conduct
conductor
disable
disappear
disappoint
discipline
disclose
discover
discovery
hoist
hold
holder
household
however
huddle
narrative
narrow
nasty
nation
national
nationality
native
natural
nature
overall
overcome
overlap
portion
possibility
possible
potential
pour

#쐊찦얡 Unit 7
confine
confirm
conflict
confidence
confident
confidential
trail
train
training
trait
traitor
victim
view
viewpoint
violence
violent
virtual
virtue
apparent
appeal
appear
appearance
appliance
applicable
application
appoint
appointment
apply
appreciate
discriminate
discuss
disease
disgrace
escape
especially
essay
essence
essential
establish
estimate
ethic
ethnic
evaluate
industrial
industrialize
industry
inevitable
miserable
misery
mislead
mix
mixture
necessary
necessitate
necessity
negative
negotiate
outer
outlet
outline
outlook
output
poverty
power
practical
practice
practise
practitioner
preach
precede
precaution
precedent
preceding
precious
precise
precision
stress
stretch

#쐊찦얡 Unit 8
addict
add
addition
additional
address
adequate
adjoin
adjust
administration
admire
admission
admit
adapt
adopt
adult
brace
brain
branch
brand
toss
total
touch
tough
vice
vicious
click
client
cling
close
closet
code
personal
personality
personnel
form
formal
format
formation
former
formidable
formula
formulate
fortunate
fortune
guide
guidance
guideline
guild
guilt
guilty
recognition
recognize
recommend
recover
recovery
recruit
sell
send
senior
smart
smell
soak
soar
sociable
social
socialism
society
sociology
soluble
solution
solve
detach
detail
detain

#쐊찦얡 Unit 9
shadow
shade
sort
soul
sound
sour
source
advance
advanced
advantage
advice
advise
advisable
advocate
esthetic
aesthetic
affair
affect
affection
affiliate
affirm
afford
breach
break
breakdown
breed
coincide
collapse
colleague
collect
collection
collective
collide
column
combat
combine
command
commend
comment
commerce
commercial
commission
commit
committee
commodity
common
communicate
communication
communism
community
detect
deteriorate
determine
develop
device
devise
ensure
entail
indeed
independence
independent
index
mere
merely
plausible
plea
plead
plot
policy
polite
political
politician
politics
poll
ponder

#쐊찦얡 Unit 10
brisk
brief
brittle
browse
aggravate
aggressive
agitate
agreeable
aid
aim
alarm
alien
alienate
allocate
allow
alter
alternate
alternative
comparable
comparative
compare
comparison
compel
compensate
compete
competition
competitive
competent
compile
complain
complaint
complement
complete
complex
complicate
complicated
comply
compliment
differ
difference
diffuse
emphasis
emphasize
employ
employee
employer
employment
enable
encounter
encourage
end
endeavour
endorse
indicate
indication
indicative
outrage
outset
outside
outward
special
specialist
specialize
speciality
species
specific
specification
specify
speculate

#쐊찦얡 Unit 11
perform
performance
period
periodical
perish
perpetual
perplex
perspective
pessimistic
optimistic
optimum
option
optional
organ
organic
organism
organization
organize
enhance
enlarge
enlighten
rake
rare
rarely
rate
ratio
rational
reach
react
realistic
reality
realize
select
selection
sense
sensation
sensible
sensitive
separate
sequence
serial
series
serious
toast
together
token
tolerance
tolerant
tolerate
accumulate
accuracy
accurate
accuse
achieve
acknowledge
cheer
chemical
cherish
chip
choice
choose
board
boast
bonus
boom
boost
verbal
verdict
verify
verse
version
vessel

#쐊찦얡 Unit 12
acclaim
accommodate
accommodation
accompany
accomplish
account
accountant
bias
bid
bill
billion
birth
charge
charm
chase
demand
democracy
democratic
demonstrate
denote
denial
deny
department
depend
dependent
deposit
depress
emerge
emergency
eminent
emotion
fear
fearful
feature
federal
federation
feed
feedback
feeling
fertile
goal
goods
govern
government
governor
gradual
graduate
grand
grant
heap
heal
health
healthy
hesitate
highlight
highland
highly
immediate
immense
immerse
immigrant
immune
likely
likelihood
likewise
self
selfish

#쐊찦얡 Unit 13
beam
become
deprive
derive
describe
description
deserve
design
designate
desirable
desire
flaw
flexible
fling
flourish
grow
grown-up
growth
hinder
hint
hitherto
impact
impair
impart
implement
implication
implicit
imply
import
importance
important
impose
impress
impression
impressive
improve
impulse
limit
limitation
limited
origin
original
originate
petition
phase
phenomenon
philosopher
philosophy
phrase
physical
physician
pierce
reason
reasonable
recent
serve
servant
service
set
setback
setting
settle
settlement
several
severe
shape
share
sharp
shelter
sophisticated
sovereign
sow
toll
tone
topic

#쐊찦얡 Unit 14
choke
chop
circumstance
cite
claim
clear
border
bore
born
bother
acquire
acquisition
act
action
activate
active
activity
actual
acute
despise
despite
energetic
energy
enforce
engage
engagement
fold
folk
follow
following
force
fore
forecast
foresee
forge
grim
grasp
grip
gross
ground
group
guarantee
guard
include
inclusive
income
incorporate
increase
increasingly
incredible
incur
link
list
literally
literary
literature
memo
memorial
memory
mental
mention
other
otherwise
outcome
sign
signature
signal
significance
significant
signify
similar
simple
simplicity
simplify
simply
slack

#쐊찦얡 Unit 15
meditate
meditation
medium
elaborate
elegant
element
elementary
eliminate
abolish
absence
absent
abroad
absolute
absorb
abstract
ban
bar
bare
barely
bargain
capable
capacity
capital
captive
capture
career
careful
case
cast
casual
casualty
catch
category
cater
cause
caution
cautious
cease
celebrate
celebrity
ceremony
certain
certainty
certificate
certify
decline
decrease
deem
dedicate
deduce
deduct
fashion
fashionable
favor
favourable
favourite
sit
site
situation
skeleton
skeptical
sketch

#쐊찦얡 Unit 16
radiant      
radiate     
radical     
ideal    
ideology     
identical      
identification  
identify
identity     
journal     
journalist  
journey  
judge        
judgment    
judicial        
jury
justice      
justify     
key         
knit     
label        
lag            
largely         
lateral
latter       
law         
magnitude   
magnify  
magnificent  
maintain       
maintenance     
major
majority     
make        
theme       
theory   
theoretical  
therapy        
object          
objective
objection    
obligation  
oblige      
obscure  
observation  
observe        
obsession       
obsolete
obtain       
obvious     
pace        
panel    
panorama     
qualification  
qualify         
quality
qualitative  
safeguard   
safety      
savage   
save         
saving         
scale           
scene
scenery

#쐊찦얡 Unit 17
tow
towards
take
talent
target
taste
technical
technician
technique
technology
teenager
temper
temperature
temporary
tempt
temptation
tend
tendency
tentative
term
terminal
terminate
testify
trace
understand
understanding
undertake
uneasy
unemployment
unexpected
unify
union
unique
universal
universe
unlike
unlikely
unusual
vague
vain
valid
valuable
value
vanish
variable
variation
variety
various
vary
vast
wage
wander
want
way
weak
wear
weary
weight
weird
weld
welfare
whirl
whisper
yield
youth
zigzag
zone
zoom

#쐊찦얡 Unit 18
abandon
abide
ability
able
abnormal
background
balance
base
basement
basic
basis
calculate
call
calm
campaign
candidate
data
database
date
dazzle
deal
dealer
debate
decade
decide
decision
decisive
decorate
economic
economical
economics
economy
educate
education
effect
effective
efficient
efficiency
effort
fabric
fabricate
face
factor
fade
fail
failure
fair
fairly
fall
fan
fancy
fascinate
gain
gamble
gap
gene
general
generalize
habit
habitat
hamper
handicap
shield
shift
shoulder
show
shower

#쐊찦얡 Unit 19
glamour
generate
generation
generator
generous
genius
gift
genre
giant
gigantic
give
happen
harm
harmony
harsh
ignorance
ignorant
ignore
ill
illness
illusion
illustrate
illustration
image
imagine
imaginary
imagination
imaginative
imitate
imitation
lead
leadership
leading
legal
legislation
legitimate
leisure
level
lever
levy
manage
management
manifest
manipulate
manner
margin
marginal
mass
massive
massacre
occupation
occupy
occur
occurrence
offend
offer
offset
offspring
paragraph
paralyse
parallel
part
partial
participant
participate
particle
particular
partly
partner
passion
passive
quick
quit
quest
questionnaire
quote
span
spare
schedule
scheme
science
scientific
scientist

#쐊찦얡 Unit 20
embrace
embed
embody
embryo
elite
elsewhere
thirst
thorough
though
thought
thoughtful
threat
threaten
update
upgrade
uphold
upset
up-to-date
ventilate
venture
widespread
win
wit
withdraw
witness
inaugurate
incentive
incidence
incident
incidentally
incline
academic
academy
accelerate
accept
acceptance
access
accessory
begin
beginning
behalf
behave
behavior
belief
believe
belong
beneficial
benefit
challenge
chance
change
channel
character
characterise
characteristic
defend
delicate
deliver
delivery
fiction
field
fierce
fight
figure
finance
financial
finding
finite
firm
first
fit
fitting
global
globe

#쐊찦얡 Unit 21
patch
patent
pattern
pay
payment
peculiar
peer
per
perceive
percentage
perfect
rail
railroad
raise
rally
random
range
rank
master
masterpiece
mate
material
mathematical
mature
maximum
mean
meaning
means
meantime
meanwhile
measure
opening
opera
operate
operation
operational
operator
opinion
opportunity
opponent
oppose
opposite
oppress
scope
score
scorn
secure
security
see
seek
seem
seemingly
thrift
thrill
thrive
through
throughout
tip
title
urban
urge
urgent
utilize
utter
wonder
worship
worth
worthwhile
worthy
write
writer

#쐊찦얡 Unit 22
curious
curiosity
currency
current
cut
average
avoid
awake
award
aware
awkward
extravagant
extreme
invisible
involve
issue
item
overturn
overwhelm
purchase
pursue
pursuit
puzzle
reverse
review
revise
revive
reward
rich
rise
risk
rival
role
roll
root
route
routine
row
rule
ruler
surname
surpass
surplus
surprise
survey
survival
survive
susceptible
suspend
suspect
suspicion
suspicious
sustain
swarm
swear
swell
swing
switch
system
systematic
logic
logical

#쐊찦얡 Unit 23
twist
trivial
try
tumble
turbulent
turn
turnover
type
typical
volunteer
vote
vulgar
vulnerable
author
authority
auxiliary
avail
available
critic
critical
criticism
criticize
crucial
culprit
cultivate
culture
dubious
due
durable
duration
duty
dynamic
extinct
extinguish
introduce
introduction
invest
investment
investigate
mutual
mysterious
mystery
myth
noble
norm
normal
normalization
note
notion
public
publication
publicity
publish
result
resultant
resume
reveal
revelation
revenge
revenue
supply
support
suppose
suppress
supplement
supreme

#쐊찦얡 Unit 24
project
profit
profitable
profound
program
progressive
prohibit
prolong
prominent
promise
promising
promote
prompt
proof
reservation
reserve
resist
resistance
resistant
resort
resource
respect
respective
respond
response
responsibility
responsible
succeed
success
successful
succession
successive
successor
suck
sue
suffer
suffice
sufficient
suggest
suggestion
suicide
suit
suitable
super
superb
superficial
superfluous
superior
superiority
supervise
trigger
triumph
assure
assurance
astonish
atmosphere
council
counsel
drama
dramatic
exploit
explore
intellectual
intelligence
intelligent
intelligible

#쐊찦얡 Unit 25
rescue
research
resent
refresh
refute
region
regular
regulate
regulation
replace
reply
report
reporter
reputation
request
require
requirement
assess
assimilate
assist
assistance
assistant
assume
assumption
contribute
contribution
controversial
controversy
control
convention
converge
convey
domain
domestic
dominant
dominate
doom
double
doubt
probe
procedure
proceed
proceeding
process
procession
proclaim
produce
product
production
productive
productivity
profession
professional
expand
expansion
expect
expectation
experience
experiment
expert
expertise
expire
instinct
institute
institution
insurance
insure
integral
integrate
integrity

#쐊찦얡 Unit 26
polish
point
propel
proper
property
proportion
proposal
propose
proposition
prospect
prospective
restore
restrain
restraint
restrict
attach
attack
attain
attempt
attend
attention
attitude
attribute
court
courtesy
cover
create
creative
credit
crisis
drive
drug
export
expose
exposure
express
expression
extend
extension
extensive
extent
human
humanity
humble
intend
intention
intense
intensity
intensive
interact
intercourse
interest
interior
internal
international
interpret
lose
loss
low
lower
nerve
nervous
nevertheless

#塤몺 Unit 1
gallop
gallery
galaxy
peel
peep
penalty
penetrate
peninsula
penny
pension
people
perfume
permanent
permeate
permission
permit
quantify
quantitative
quantity
race
racial
rack
racket
radio
radioactive
radius
rag
rage
raid
semester
semiconductor
seminar
senate
senator
sentence
sentiment
session
sew
shine
shipment
shiver
shock
shoot
shot
shopkeeper
shore
shortage
shortcoming
shorthand
shove
temple
tempo
tenant
tender
tense
tension
tent
then
thereafter
thereby
therefore
vest
veteran
veto
walk
ward
wardrobe
warehouse
warfare
warmth
warn
warrant
aerial
affluent
afterward
afterwards
against
age
coach
coalition
coarse
cognitive
inject
injure
injury
ink
inland
inlet
blank
blanket
light
lightning

#塤몺 Unit 2
bake
bait
bachelor
backward
bacterium
bad
badly
badge
badminton
baggage
bail
abdomen
aboard
abound
above
abrupt
absurd
abundant
abuse
cab
cabinet
cable
calendar
calorie
damage
damn
damp
eager
ear
earnest
earth
ease
east
ebb
fable
fabulous
facilitate
facility
faculty
gang
gaol
jail
garage
garbage
gas
gasp
gather
gauge
gay
gaze
gear
gender
hail
hall
halt
hand
handbook
handful
handle
handy
hang
ham
hammer
ice
idiom
idle
if
ignite
illegal
illiterate
illuminate
jam
jargon
jaw
jealous
jet
jewel
jewelry

#塤몺 Unit 3
veil
vein
velocity
velvet
vertical
verge
versatile
versus
peaceful
peak
pearl
pedal
pedestrian
harassment
harbor
harbour
hard
harden
hardly
hardship
hardware
hero
heroic
heroin
heroine
impatient
imperative
imperial
impetus
lane
lantern
lap
lapse
laser
lash
mankind
manoeuvre
manual
manufacture
manuscript
obstacle
obstruct
obstruction
occasion
occasional
odd
odds
odor
odour
scissors
scold
scout
scramble
scrap
scrape
scratch
scream
screen
screw
script
scrutiny
sculpture
seal
seam
seaside
second
secondary
secretary
section
sector
segment
segregate
seize
tear
tease
tedious
telegram
telegraph
telescope
tell
undo
undoubtedly

#塤몺 Unit 4
naked
nail
naive
namely
nap
napkin
naughty
keen
keyboard
labor
labour
lace
lack
lad
lamb
lame
lamp
machine
machinery
mad
magic
magistrate
magnet
magnetic
maiden
main
mainland
oar
oath
obedience
obedient
obey
pack
package
pact
pad
paddle
pain
painful
paint
painter
pair
pale
palm
pamphlet
panic
pant
paper
paperback
parachute
parade
paradise
paradox
parameter
parasite
parcel
pardon
parliament
sack
sacred
sacrifice
saddle
sample
sanction
sandwich
sane
sarcastic
satellite
ugly
ultraviolet
umbrella
unanimous
uncover
vacant
vacation
vaccine
vacuum
valve
wagon
waggon
waist
wake
waken
X-ray
yard
yawn
yearly
yell
yet
zeal
zero
zip
agency
agenda
agony

#塤몺 Unit 5
battle
battery
bay
adhere
adjacent
adolescent
adore
advent
adventure
adverse
advertise
ceiling
cell
cement
censorship
census
cent
center
central
century
centigrade
centimetre
cereal
debt
debut
decay
deceit
deceive
decent
decimal
ego
fare
farewell
farther
fast
fasten
fate
fatal
fatigue
fault
faulty
fax
giggle
glacier
glare
glance
glimpse
glitter
glow
harvest
haste
hasty
hatch
hatred
haul
hawk
hay
hazard
he
jog
joint
jolly
kid
kidnap
kidney
kill
late
lately
later
latent
latitude
laughter
launch
laundry
reckless
reckon
reclaim

#塤몺 Unit 6
bath
bathe
batch
acquaint
acquaintance
across
satisfaction
satisfactory
satisfy
satire
saturate
sauce
saucer
sausage
saw
scan
scandal
scar
scarce
scarcely
scare
scarf
scatter
scenario
scent
scholar
scholarship
school
tablet
taboo
tackle
tactics
tag
tailor
tale
tame
tan
tangle
tank
tanker
tap
tape
tar
tariff
tax
undergraduate
underground
undermine
underneath
van
vanity
vapor
vapour
vegetarian
vegetation
vehicle
cash
cashier
catalog
catalogue
catastrophe
dead
deadline
deadly
deaf
dean
edible
edit
edition
editor
editorial
fake
false
fame
familiar
family
famine
fantastic
fantastical
fantasy
reassure
rebel
rebellion
recede
receipt
reception
recession
recipe
recipient
reciprocal
recite

#塤몺 Unit 7
sail
sailor
saint
sake
salad
salary
salute
salvation
accent
accident
accord
accordance
according to
accordingly
ache
acid
bald
ballet
ballot
band
bandage
bang
bankrupt
banner
banquet
barbecue
bark
barn
barrel
barren
barrier
camel
camp
campus
can
cancel
cancer
cape
captain
carbohydrate
carbon
cardinal
caress
cargo
carriage
carrier
carry
carrot
carve
eccentric
echo
ecology
edge
faith
faithful
gentle
gently
genuine
geography
geology
geometry
germ
gesture
ghost
majesty
male
malignant
passage
passerby
passport
paste
pastime
pat
path
pathetic
patience
patriotic
patrol
patron
pause
pave
pavement
dance
dash
daunt
dawn
daily
daylight

#塤몺 Unit 8
chat
chain
chair
chairman
chamber
champagne
champion
chancellor
chaos
chap
chapter
charity
chart
charter
deck
declaration
declare
deed
default
defeat
defer
defect
deficiency
deficit
degenerate
either
eject
elapse
elastic
elbow
feasible
feast
feat
feather
glide
gloomy
glory
glorious
glue
headline
headquarters
hearing
heart
heat
member
membership
menace
mend
persecute
persevere
persist
persuade
persuasion
pest
petrol
petroleum
petty
pharmacy
phone
pile
pilgrim
pill
pillar
pilot
quarrel
quart
quarter
quartz
slip
slipper
slippery
slit
slogan
slope
slot
slum
sly
smash
smog
smooth
smuggle
bear
beard
rap
rape
rapid
rash
raw
ray
reader
reading
readily
realm
reap
rear

#塤몺 Unit 9
bend
beneath
benign
beside
besides
amplifier
amplify
analog
analogue
analogy
analyse
analyze
analysis
analytic
analytical
inertia
infant
infect
infectious
infinite
inflation
infrared
infrastructure
knee
kneel
knob
knot
knowledge
leaf
leaflet
league
leak
lean
leap
lease
leather
mechanic
mechanical
mechanism
nickname
nightmare
nominal
nominate
pleasure
pledge
plentiful
pneumonia
pocket
poison
poisonous
regard
regarding
regardless
regime
register
rehearse
reign
rein
reinforce
simulate
simultaneous
sin
sincere
single
singular
sink
sip
siren
thumb
thunder
tick
ticket
wealth
wealthy
weapon
weave
web
wedge
jungle
junction
junior
juvenile
junk
unload
upper
upright
uproar
upstairs
upward

#塤몺 Unit 10
skate
ski
skill
skilled
skillful
skim
skin
skip
skull
skyscraper
slam
slap
slaughter
sleeve
slender
slice
slide
slight
slim
climate
climax
climb
clip
cloak
clockwise
clone
descend
descendant
descent
desert
endow
endure
endurance
graph
graphic
grateful
gratitude
grave
gravity
graze
grease
inhabit
inhabitant
inhale
inherent
inherit
inhibit
medal
medical
medicine
medieval
meet
melody
melt
plight
plough
plow
plug
plumber
plunge
plural
plus
fiber
fibre
file
fill
film
filter
relax
relay
release
relief
relieve
relish
reluctant
treason
treasure
tremble
tremendous
trench
usage
useful
utmost
bold
bolt
bomb
bond
bone

#塤몺 Unit 11
shabby
shaft
shake
shallow
sham
shame
shampoo
shatter
shave
shear
shed
terrible
terrific
terrify
territory
terror
textile
texture
wash
waste
watch
ahead
air-conditioning
aircraft
aisle
alert
alike
alive
cheat
cheque
check
chest
chew
chief
chieftain
childhood
chill
chorus
Christ
Christian
chronic
church
pin
pinch
pint
delegate
delete
delicious
delight
elect
electric
electrical
electrician
elevate
elevator
eligible
eloquent
embark
embarrass
emigrate
emit
empire
empirical
empty
fee
feeble
grief
grieve
grin
grind
office
officer
official

#塤몺 Unit 12
sick
side
sideways
siege
sigh
sight
sightseeing
silence
silent
silicon
silly
silver
thread
threshold
throne
throw
thrust
unfold
unfortunately
uniform
unit
unite
unity
violet
virgin
virus
vocal
vocation
voice
volcano
voyage
waterfall
waterproof
wave
wax
although
altitude
altogether
ambassador
amiable
amid
belly
beloved
below
belt
bench
clap
clarify
clarity
clash
clasp
class
classic
classical
classification
classify
clause
depart
departure
depict
deplore
depth
deputy
enclose
enclosure
gorgeous
gossip
gown
grade
grain
gram
gramme
hedge
heel
height
heighten
heir
helicopter
hell
helmet
helpful
hemisphere
hence
henceforth
herald
herb
herd
heritage

#塤몺 Unit 13
pioneer
pipe
pirate
pistol
piston
pit
pitch
plague
plain
planet
plant
plantation
lay
layer
layman
layout
marathon
marble
march
marine
marital
married
mark
marvelous
Marxist
mask
naval
navigation
navy
nearby
nearly
neat
necklace
needle
Negro
neighbourhood
queer
quench
queue
quiver
quiz
quota
recall
recollect
reconcile
recur
recreation
recycle
rectify
redundant
reed
reel
sheer
sheet
shepherd
shrewd
shrink
shut
shutter
shuttle
shy
theatre
theft
thermal
thermometer
thesis
thick
thigh
thorn
thousand
via
vibrate
vicinity
video
violate

#塤몺 Unit 14
beg
behind
being
all
allege
allegiance
alleviate
alliance
allowance
alloy
ally
alone
along
alongside
alphabet
denounce
dense
density
fell
fellow
fellowship
female
feminine
fence
ferry
fetch
feudal
fever
heave
heaven
heavy
indoor
induce
indulge
kin
kindness
king
kingdom
kit
mat
match
may
mayor
nest
net
network
neutral
neutron
new
omit
opaque
opt
optical
plaster
plastic
plate
plateau
platform
play
refine
refrain
refuge
refugee
refund
refusal
refuse
circle
circuit
circular
circulate
citizen
civil
civilian
civilize
civilise
civilization
civilisation
goat
gold
golden
grab
grace
graceful

#塤몺 Unit 15
tie
tide
tidy
tight
tile
tilt
weekday
weekly
weed
weep
well-known
wet
ancestor
ancient
and
anecdote
angel
angle
anger
angry
ankle
anniversary
announce
antenna
antique
bet
betray
better
between
beware
bewilder
beyond
cloth
clothe
clothes
clothing
cloud
cloudy
clue
clumsy
cluster
clutch
desolate
despair
desperate
destination
destiny
destruction
destructive
engine
engineer
engineering
enormous
enquire
enrich
enrol
enroll
final
finally
fine
finish
fire
fireman
fireplace
fiscal
fish
fisherman
inn
inner
innumerable
input
inquiry
lecture
legacy
legend
lend
lens
lest
poke
polar
pole
pollute
pollution
pool
remark
remarkable
greedy
green
greenhouse
greet
greeting

#塤몺 Unit 16
snap
snatch
sneak
sneeze
sniff
snobbish
detective
detector
deviate
devil
devote
fix
fixture
flame
flap
flare
flash
flat
flatter
flavour
flee
flesh
flight
any
anybody
anyhow
anything
anyway
anywhere
asset
assign
assignment
bibliography
bin
bind
biography
biology
bit
bite
bitter
bizarre
coherent
cohesive
coin
coke
collaborate
collar
colonel
colonial
colony
combination
enthusiasm
enthusiastic
entire
entitle
entity
entrepreneur
entrance
entry
whale
whatever
whenever
whereas
wherever
whichever
while
whip
whistle
whoever

#塤몺 Unit 17
sob
sober
software
soil
solar
sole
solemn
solid
solidarity
solo
somewhat
hierarchy
hijack
hike
historical
historian
hinge
hip
hire
insert
inside
insight
insist
inspect
inspiration
inspire
lick
lid
lie
life
lifetime
lift
merchandise
merchant
mercury
mercy
merge
merit
merry
metal
metaphor
metre
meter
metric
metropolitan
none
nonsense
oral
orbit
order
orderly
ordinary
orient
oriental
orientation
pop
pope
popular
porcelain
portable
porter
portfolio
portrait
portray
post
postage
poster
postman
postpone
posture
remnant
renaissance
renew
renovate
rent
repair
repay
repeat
repeatedly
repel
repertoire
repetition
tire
tiresome
tissue
toil
blade
blame
blast
blaze

#塤몺 Unit 18
apartment
ape
apologize
apologise
apology
bleak
bleed
blend
bless
comfort
come
comedy
comet
comic
commemorate
commence
commonplace
commonwealth
commute
diagnose
diagram
dial
dialect
diameter
dictate
dictation
diet
differentiate
dig
digest
digital
dignity
envisage
envy
equal
equality
equivalent
equation
equator
float
flock
flood
flow
flu
fluctuate
fluent
fluid
flush
fly
microphone
microscope
midst
migrate
mild
millionaire
mill
notable
nothing
notice
notify
notorious
notwithstanding
ornament
orthodox
pot
pound
powder
represent
representative
repression
reproach
reproduce
republic
republican
sore
sorrow
so-called
spark
sparkle
space
spacecraft
spaceship
spacious

#塤몺 Unit 19
beast
beat
before
blind
block
blood
bloody
tomb
tongue
tool
top
torch
torment
torture
torrent
whole
wholly
wholesome
appal
appall
apparatus
appendix
appetite
applaud
applause
appraisal
approximate
arbitrary
arch
compact
companion
company
compartment
compass
compassion
compatible
composite
compound
compulsory
compute
conceal
concede
concert
concession
dilemma
diligent
dimension
dine
dinosaur
dioxide
dip
diploma
diplomatic
direction
director
directory
equip
equipment
groan
grocer
grope
hobby
hollow
homogeneous
honest
instal
install
installation
installment
instance
instant
instantaneous
limb
limp
linear
linen
liner
linger
linguistic
mine
mineral
mingle
miniature
minimize
minimise
minimum
minister
ministry
minor
minority
minus
minute

#塤몺 Unit 20
bloom
blossom
blow
blueprint
blunder
blunt
blur
blush
praise
pray
prayer
resemblance
resemble
reservoir
residence
resident
resign
resolute
resolution
resolve
specimen
spectacle
spectator
spectrum
sphere
spicy
spill
spin
spine
spiral
spirit
spiritual
spit
spite
splash
splendid
split
spontaneous
spot
spouse
timber
time
timely
timid
tin
tiny
tower
toxic
wicked
widow
width
wild
wind
wink
arm
army
congratulate
congratulation
conjunction
conquer
conquest
disaster
disastrous
discard
discern
era
erase
erect
erosion
erroneous
error
erupt
escalate
escort
foam
focus
fog
guitar
gulf
nourish
novel
novelty
nowadays
nowhere

#塤몺 Unit 21
hop
hook
hormone
horn
horrible
horror
horsepower
hose
instruct
instruction
instrument
instrumental
insulate
insult
liquid
liquor
litter
miracle
mirror
mischief
misfortune
miss
missile
missing
mission
missionary
nuclear
nucleus
preclude
predominant
pregnant
rest
restless
spray
spring
sprinkle
sprout
square
squeeze
stab
stack
stagger
stagnant
trade
trademark
traffic
around
arrange
arrest
arrive
arrival
arrogant
arrow
conscience
conscientious
consecutive
consensus
consent
consolidate
conspicuous
conspiracy
consult
consultant
wipe
wire
wise
wisdom
witch
withhold
within
withstand

#塤몺 Unit 22
ash
ashamed
ashore
aspect
aspire
lumber
lump
lunar
lung
luxury
lyric
bracket
brake
brandy
brass
brave
cosmic
cost
costume
cosy
couch
count
counter
counterpart
country
countryside
county
excitement
exclaim
excursion
excuse
exempt
exercise
foremost
forgive
forth
forthcoming
fortnight
hospitality
host
hostage
hostess
hostile
hound
hover
howl
dock
doctrine
donate
dose
dot
intimate
intimidate
intricate
intrigue
intrinsic
intrude
intuition
invade
invasion
invalid
invaluable
invariable
proficiency
profile
rip
ripe
ritual
roar
roast
rob
robust
rock
rod
motion
motivate
motive
motor
mount
mourn
move
stiff
still
sting
stitch

#塤몺 Unit 23
body
boot
booth
bosom
boss
botany
bottom
art
artery
article
articulate
artificial
artist
artistic
disrupt
dissipate
distance
distant
distill
distress
district
disturb
disturbance
eve
even
event
eventually
ever
for
forbid
forehead
foreign
foreigner
look
loom
loop
loose
loosen
lord
lorry
lottery
loudspeaker
moan
mob
mobile
mobilize
mobilise
module
mold
mould
pretext
pretty
prevail
prevalent
rhythm
rib
ribbon
rid
riddle
ridge
ridiculous
rigid
rigorous
rim
riot
static
statical
station
stationary
stationery
steak
steam
steep
stereotype
steward
transcend
transistor
transit
translate
transparent
intact
interface
interfere
interference
intervene
contemplate
contrive
convenience
convenient
conversation
conversely
conversion
convert
convict
conviction
convince

#塤몺 Unit 24
romance
romantic
bounce
bound
boundary
trap
trash
travel
tray
wooden
work
workshop
as
ascend
ascertain
cool
cooperate
cooperative
coordinate
cope
copy
copyright
copper
cord
cordial
core
corn
corporation
correct
correlate
correspond
correspondence
correspondent
corrode
corrupt
dive
divine
divorce
dizzy
evoke
exact
exceed
exceedingly
excel
except
exception
exceptional
excerpt
excess
gum
gun
gut
interim
intermediate
intermittent
interrupt
intersection
interval
interview
loyal
loyalty
lubricate
luck
lucky
moist
moisture
molecule
momentum
monarch
monetary
monitor
monster
monument
prick
pride
priest
prize
probability
probable

#塤몺 Unit 25
lively
liver
living
loaf
loan
lobby
locomotive
lodge
lofty
log
long
longitude
discount
discourage
discreet
discrepancy
disguise
disgust
dislike
dismay
disposal
dispose
disposition
estate
esteem
eternal
evacuate
evade
evaporate
fond
fool
foolish
foot
footstep
mist
mistake
mistress
misunderstand
nuisance
numb
numerical
numerous
nursery
nurture
nut
nutrition
ought
outbreak
outdoor
outfit
outing
outskirts
outstanding
retail
retain
retention
retire
retort
retreat
retrieve
retrospect
revolt
revolution
revolutionary
revolve
stalk
stain
stake
stale
stall
staple
stamp
stare
tragedy
tragic
tram
tramp
bow
bowel
bowl
bowling
boycott
contact
contagious
contain
contaminate

#塤몺 Unit 26
stoop
storm
strange
stranger
strap
straw
strawberry
stream
streamline
trial
triangle
tribe
tribute
trick
trifle
trim
trip
triple
worldwide
worm
worry
worse
wound
wrap
wreck
astronaut
astronomy
atom
breast
breath
breathe
breeze
bribe
bridge
bright
brilliant
brim
bring
couple
coupon
courage
course
cow
coward
downtown
down
downward
doze
drag
dragon
drain
drastic
draw
drawback
drawer
drawing
exhibit
exhibition
exile
exit
forum
forward
foster
foul
foundation
fountain
fraction
fracture
fragile
fragment
fragrant
mortal
mortgage
mosaic
moss

#塤몺 Unit 27
hug
huge
hum
auction
audience
audio
audit
auditorium
augment
aural
authentic
broad
broadcast
brook
bruise
brush
brutal
bucket
bud
buffet
bug
crack
cradle
craft
crash
crazy
cream
creature
credentials
crawl
creep
crew
draft
dread
dress
drift
drill
drip
drop
drought
drown
drum
expedition
expel
expend
expenditure
expense
explanation
explicit
explode
explosion
explosive
frame
framework
franchise
frank
fraud
freedom
freeze
freight
frequency
frequent
fresh
friction
strife
strive
struggle
strip
stripe
stroke
stroll
strong
stubborn
studio
stuff
stumble
sturdy
style
submarine
submerge
subtract
suburb
sudden

#塤몺 Unit 28
bump
burn
burst
bury
crime
criminal
cripple
crisp
criterion
crop
cross
crow
crowd
crown
exquisite
exterior
external
extra
extract
extraordinary
friendly
friendship
fright
frighten
fringe
frontier
frost
frown
fry
fuel
fume
funeral
humid
humidity
humiliate
humor
humour
humorous
hunt
hurl
hurricane
hygiene
hypothesis
hysterical
hypocrisy
invent
invention
inventory
inverse
invert
invitation
inward
oval
overflow
overhaul
overhead
overhear
overnight
overtake
overthrow
overtime
prone
pronounce
propaganda
prophet
roof
rope
rotary
rotate
rot
rotten
rough
round
roundabout
rouse
suite
sum
summary
summit
summon
sunrise
sunset
sunshine

#塤몺 Unit 29
tug
tuition
tune
tunnel
turbine
turkey
turmoil
tutor
automatic
automation
autonomy
avenue
avert
await
awe
awful
ax
axe
axis
bulk
bully
but
button
buzz
by
by-pass
crude
cruel
cruise
crush
crust
crystal
dull
dumb
dump
duplicate
dusk
dwarf
dwell
dye
dynasty
fur
furnish
further
furthermore
fuse
fuss
futile
iron
irony
irrespective
irrigate
irritate
isle
isolate
ivory
musical
musician
mute
mutter
mutton
owe
owing
owner
ownership
ozone
prosecute
prosper
prosperity
prosperous
protect
protein
protest
prototype
proud
province
provision
provoke
royal
royalty
rub
rubber
rude
ruin
supermarket
supersonic
superstition
surrender
surround
surroundings

#塤몺 Unit 30
cycle
cylinder
cube
cue
cunning
curb
cure
curl
curriculum
curse
curve
custom
cyberspace
surface
surge
surgeon
surgery
swallow
swamp
sway
sweat
sweep
swift
swim
symbol
symmetry
sympathetic
sympathize
sympathise
sympathy
symphony
symposium
symptom
syndrome
synthesis
synthetic
much
mud
mug
murder
murmur
multiple
multiply
multitude
municipal
muscle
muscular
puff
pull
pulse
pump
punch
punctual
punish
puppet
pure
purify
purpose
purse
rumor
rumour
run
rural
rush
rust
ruthless
attendant
attorney
attract
attractive
bunch
bundle
burden
bureau
bureaucracy
burglar
troop
tropic
tropical
troublesome
true
trust
trunk
tube
tuck
twin
twinkle
wrench
wrinkle
wrist